{
  "personalInfo": {
    "name": "Emerson Silva Ricardo",
    "title": "Network and Infrastructure Analyst | Linux | Datacom | Mikrotik | Zabbix",
    "location": "Fortaleza, Ceará, Brasil",
    "contact": {
      "city": "Pindoretama",
      "mobile": "085992933087",
      "email": "silvaemerson797@gmail.com",
      "linkedin": "https://www.linkedin.com/in/emerson-silva-ricardo-543308119"
    }
  },
  "summary": "Profissional de redes com experiência em suporte técnico, configuração de equipamentos e solução de problemas. Habilidade em coordenação de projetos, gestão de equipe e comunicação técnica. Foco em eficiência, adaptação e entrega de resultados.",
  "skills": [
    "Análise de sistemas",
    "Redes LAN-WAN",
    "Redes sem fio",
    "Inglês para Tecnologia da Informação",
    "Switches DmOS - Layer 2",
    "Switches DmOS - Layer 3",
    "Redes GPON",
    "Jornada Mikrotik",
    "Linux",
    "Datacom",
    "Mikrotik",
    "Zabbix"
  ],
  "experience": [
    {
      "company": "JR.NET",
      "duration": "4 anos 5 meses",
      "roles": [
        {
          "title": "Gerente de suporte de operações de tecnologia da informação / Noc rede",
          "period": "fevereiro de 2023 - Presente (2 anos 6 meses)",
          "location": "Pindoretama, Ceará, Brasil",
          "responsibilities": [
            "Supervisão e coordenação das operações diárias do NOC para garantir a disponibilidade contínua e o desempenho otimizado da rede.",
            "Gestão de equipe, incluindo escalonamento de problemas, treinamento e desenvolvimento de membros da equipe.",
            "Implementação e manutenção de processos de monitoramento proativo para identificar e resolver problemas de rede antes que afetassem os usuários.",
            "Colaboração com equipes de engenharia e segurança para implementar políticas e procedimentos de segurança de rede.",
            "Planejamento e execução de atualizações de infraestrutura de rede e projetos de expansão para atender às necessidades empresariais em evolução.",
            "Documentação detalhada de procedimentos operacionais e relatórios de desempenho para garantir a conformidade com as normas e facilitar auditorias."
          ]
        },
        {
          "title": "Analista de rede",
          "period": "março de 2021 - fevereiro de 2023 (2 anos)",
          "location": "Pindoretama, Ceará, Brasil",
          "responsibilities": [
            "Configuração, instalação e manutenção de equipamentos de rede, assegurando alto desempenho e disponibilidade.",
            "Monitoramento proativo da rede para identificar e resolver problemas antes que impactassem os usuários.",
            "Implementação de políticas de segurança de rede para proteger dados sensíveis e recursos da empresa.",
            "Colaboração com equipes internas e fornecedores para implementar atualizações e novas tecnologias conforme necessário.",
            "Documentação de procedimentos e configurações de rede para garantir a consistência e facilitar futuras atualizações."
          ]
        },
        {
          "title": "Técnico de redes",
          "period": "abril de 2018 - abril de 2020 (2 anos 1 mês)",
          "location": "Pindoretama, Ceará, Brasil",
          "responsibilities": []
        }
      ]
    }
  ],
  "education": [
    {
      "institution": "Estácio",
      "course": "REDES DE COMPUTADORES, REDES DE COMPUTADORES",
      "period": "2020 - julho de 2025"
    },
    {
      "institution": "E.E.E.P Edson Queiroz",
      "course": "Ensino Técnico, Informática",
      "period": "janeiro de 2015 - dezembro de 2017"
    }
  ]
}